package homework32;

public class Main01 {
  /*
  Написать программу, которая посчитает от 1 до 10.
В конце выведет "Это всё!"
Пример вывода:

   */

  public static void main(String[] args) {
    for (int i = 1; i <= 10; i++) {
      System.out.println(i);
    }
    System.out.println("Ende!");
  }
}
